public class MainClassTask {
    public static void main(String[] args) {
        for (int i = 0; i <= 10; i++) {
            System.out.println("Aikanysh");
        }
        for (int i = 1; i <= 100; i++) {
            System.out.println(i);
        }
        for (int i = 0; i <= 100; i += 2) {
            System.out.print(" " + i);
        }
        for (int i = 0; i <= 100; i += 4) {
            System.out.print(" " + i);

        }
    }
}



//        1. Вывести на экран 10 раз своё имя
//        2. Вывести на экран числа от 1 до 100
//        3. Вывести на экран все четные числа от 1 до 100
//        4. Вывести на экран все числа от 1 до 100 кратные 4
