//Создать и распечатать 45 переменных на 5 различных тем (по 9 переменных на каждую тему). Темы: любовь, религия, космос, автомобили, природа.
//
//        Все переменные создать в одном файле/классе.
//
//        Перед каждой темой нужно написать однострочный комментарий - тему.
//
//        Сдать нужно исходный код класса (java файл), скриншот успешной компиляции и выполнения.

public class Variables45 {
    public static void main(String[] args) {
//    String name = "Earth";
//    System.out.print("name: ");
//    float earthsAge = 4.55f;
//    double earthPopulation = 7.8;
//    int earthSquare = 148900000;
//    long earthSurfaceArea = 510100000;
//    short circulationPeriod = 365;
//    byte earthDay = 24;
//        char earthPeriodInYear = '1';
//        boolean theMoonIsASatelliteOfTheEarth = true;
//        System.out.println(name + "\n" + earthsAge + "\n" + earthPopulation + "\n" + earthSquare + "\n" +
//            earthSurfaceArea + "\n" + circulationPeriod + "\n" + earthDay + "\n" + earthPeriodInYear + "\n" +
//            theMoonIsASatelliteOfTheEarth + "\n");

    }
}
